// *********************************************************************************
//	当タスクの基本定数
//	[Ver]
//		Ver.01    2007/08/01  vs2005 対応
//
//	[メモ]
//		
// *********************************************************************************

#pragma once

#include "..\..\Include\LineCommon.h"									// 疵検共通ヘッダー

//=======================================
// 固定サイズ
//=======================================
#define QSIZE_TO_HY				140										// 統括->表示 受信キューバッファ
#define	QSIZE_IMG_SAVE			300										// 疵画像保存キューバッファ (代表疵)
#define	QSIZE_IMG_SAVE_LOW		200										// 疵画像保存キューバッファ (リスト部で隠れる疵)
#define	QUE_SKIP_COUNT			120										// スキップ開始キュー数 (大量の疵が発生した場合の対策)
#define THREAD_IMG_SAVE			2										// 画像保存スレッド数

#define SIZE_FFNAME_TYPE		2										// FF名称	疵種サイズ
#define SIZE_FFNAME_GRADE		2		

//=======================================
// テスト用データサイズなど
//=======================================
#define MAX_COIL_NUM			10										// テスト用に保持しているコイル情報数

//=======================================
// SPM圧下有無
//=======================================
enum EM_DIV_SPM
{
	DIV_SPM_OFF = 0,										// [SPM圧下有無] 無し
	DIV_SPM_ON,												// [SPM圧下有無] 有り
	DIV_SPM_END												// [SPM圧下有無] 終端で使用すため注意
};

//=======================================
// メッセージ通知
//=======================================
//// 全てMainInctanceで受ける
//       場合によっては、MainInctanceが各ワーカースレッドにたれ流しする
enum ENUM_MAININCTANCE {
	E_DEF_ML_PARAM = WM_USER + 100,									// パラメータ変更通知


	E_DEF_END														// 終了
};

