// *********************************************************************************
//	当タスクの基本定数
//	[Ver]
//		Ver.01    2009/07/13  vs2005 対応
//
//	[メモ]
//		
// *********************************************************************************

#pragma once

// 疵検 インクルード
#include "..\..\Include\LineCommon.h"											// 疵検共通ヘッダー

//=======================================
// 検査実績伝文(ＦＦ用)
//=======================================
#define Z_FF_RENBAN			"00"	// 連番
#define Z_FF_KMODE_NG		0		// 疵検処理モード(疵検非稼動)
#define Z_FF_KMODE_OK		1		// 疵検処理モード(疵検稼動)
#define Z_FF_KMODE_OK_O		2		// 疵検処理モード(表のみ稼動)
#define Z_FF_KMODE_OK_U		3		// 疵検処理モード(裏のみ稼動)
#define Z_FF_KMODE_STOP		4		// 疵検処理モード(停止)
#define Z_FF_KMODE_EDGENG	5		// 疵検処理モード(エッジ未検出区間有り)


#define Z_FF_DFCT_KENSA		"0"		// 疵検出区分(疵検)
#define Z_FF_DFCT_CUT		"2"		// 疵検出区分(カット)
#define Z_FF_DFCT_MAKI		"4"		// 疵検出区分(溶接巻き込まれ)

#define Z_FF_KOVER_OK		1		// 疵個数オーバーステータス(1800件以内)
#define Z_FF_KOVER_NG		2		// 疵個数オーバーステータス(1800件オーバー)


// ダミー疵固定値
#define Z_FF_KIZUNO_DUMMY	0		// 疵No

//=======================================
// 切替スイッチ
//=======================================
#define	PRO_SEND_ZI_HOSEI														// プロコン送信実績に補正率適用時、アンコメント

// 検査実測長の選択区分 (※ 切替は、各ワーカースレッドのコンストラクタで設定)
enum ENUM_DIV_LEN_SPM
{
	DIV_LEN_SPM_OFF = 0,														// SPM圧下無しの検査実測長を選択
	DIV_LEN_SPM_ON,																// SPM圧下有りの検査実測長を選択
	DIV_LEN_SPM_RESULT															// コイル実績のSPM圧下有無に従って選択
};

//=======================================
// 未送信実績の強制送信用
//=======================================
#define UNSENT_MAX			1000	// 強制送信対象レコードMAX


//=======================================
// メッセージ通知
//=======================================
//// 全てMainInstanceで受ける
//       場合によっては、MainInstanceが各ワーカースレッドにたれ流しする
enum ENUM_MAININSTANCE
{
	E_DEF_ML_PRO_R_CUT = WM_USER + 100,											// カット実績受信通知
	E_DEF_ML_PRO_R_SAI,															// 採寸実績受信通知
	E_DEF_ML_COIL_RESULT_ADD,													// 実績書き込み完了通知
	
	E_DEF_END																	// 終了
};
