// *********************************************************************************
//	当タスクの基本定数
//	[Ver]
//		Ver.01    2007/08/01  vs2005 対応
//
//	[メモ]
//		
// *********************************************************************************

#pragma once

#include "..\..\Include\LineCommon.h"									// 疵検共通ヘッダー

//=======================================
// 管理定数
//=======================================
#define MAX_THREAD			8										// 最大スレッド管理数
#define MAX_LED_BLOCK		256										// 照明装置 最大配光ブロック数
#define MAX_LED_CH			4										// 照明装置 最大チャンネル数
#define MAX_TEMP_UNIT		9										// 照明装置 温度ユニット最大数

#define DEF_ALL_INDEX		0										// 全Index指定
#define DEF_INDEX_END		4										// Index終端。この値より大きいIndexをメールスロットで受け取っても無視


//=======================================
// 輝度算出
//=======================================
#define GET_LED_VAL(a,h)   ( (a/2) + (a*h/512) +1)	// 輝度算出式 (a:全体調光データ(0オリジン), h:配光調整データ(0オリジン))

//=======================================
// カラー判定
//=======================================
//enum ENUM_COLOR{
//	ENUM_ALL_COLOR	= 0,		// 全色
//	ENUM_COLOR_RED,				// 赤
//	ENUM_COLOR_GREEN,			// 緑
//	ENUM_COLOR_BLUE,			// 青
//	ENUM_COLOR_END				// 終端
//};

//=======================================
// メッセージ通知
//=======================================
//// 全てMainInctanceで受ける
//       場合によっては、MainInctanceが各ワーカースレッドにたれ流しする
enum ENUM_MAININCTANCE {
	E_DEF_ML_PARAM = WM_USER + 100,									// パラメータ変更通知
	E_DEF_END														// 終了
};


